app/Controllers/UserController.php

    public function edit($id=null){
        try{
            $user = $this->model->find($id);
            if (!$user) {
                return $this->failNotFound("User with ID $id not found.");
            }
            $data = [
                "name" => $this->request->getVar("name"),
                "username"=> $this->request->getVar("username"),
                "email"=> $this->request->getVar("email"),
                "password" => password_hash($this->request->getVar("password"), PASSWORD_DEFAULT),
                "access"=> $this->request->getVar("access"),
            ];
            $query = $this->model->update($id, $data);
---
UPDATE `users` SET `name` = 'John mama', `username` = 'johndoe', `email` = 'john@example.com', `password` = '$2y$10$zt0le9Z71t1V3kdTWgKPA.DIZwYtgP4ohwghM3SVRwA/WAny15Hg2', `access` = 'user', `updated_at` = '2025-02-26 14:56:19'
WHERE `users`.`user_id` IN ('3')

    public function delete($id=null){
    {
        try{
            $query = $this->model->where("user_id", $id)
                             ->first();

            if ($query) {
                $this->model->delete($id);
---
UPDATE `users` SET `deleted_at` = '2025-02-26 15:03:16', `updated_at` = '2025-02-26 15:03:16'
WHERE `user_id` IN ('1')
AND `deleted_at` IS NULL