app/Controllers/UserController.php

    public function create()
    {
        try {
            $token = $this->request->user ? $this->request->user : null;
            $data = $this->request->getJSON();

            $validation = \Config\Services::validation();
            $validation->setRules([
                "name" => 'required',
                "username" => 'required',
                "email" => 'required|valid_email',
                "password" => 'required',
                "access" => 'required',
            ]);

            if (!$this->validate($validation->getRules())) {
                return $this->jsonResponse->error(implode(", ", $validation->getErrors()), 400);
            }

            if ($this->model->where('username', $data->username)->countAllResults() > 0) {
---
SELECT *
FROM `users`
WHERE `username` = 'johndoe'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function create_be()
    {
        try {
            $data = $this->request->getJSON();

            $validation = \Config\Services::validation();
            $validation->setRules([
                "name" => 'required',
                "username" => 'required',
                "email" => 'required|valid_email',
                "password" => 'required',
                "access" => 'required',
            ]);

            if (!$this->validate($validation->getRules())) {
                return $this->jsonResponse->error(implode(", ", $validation->getErrors()), 400);
            }

            if ($this->model->where('username', $data->username)->countAllResults() > 0) {
---
SELECT *
FROM `users`
WHERE `username` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1